Repository: Yash-6134/AI-based-Crop-Reccomendation-System
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hi, mr

source: No description available.
hi: कोई विवरण उपलब्ध नहीं है।
mr: वर्णन उपलब्ध नाही.

source: Information not available.
hi: जानकारी उपलब्ध नहीं है।
mr: माहिती उपलब्ध नाही.

source: Loading dataset...
hi: डेटासेट लोड किया जा रहा है...
mr: डेटासेट लोड होत आहे...

source: Found %(n)d missing values. Cleaning data...
hi: %(n)d रिक्त मान मिले। डेटा साफ किया जा रहा है...
mr: %(n)d गहाळ मूल्ये आढळली. डेटा स्वच्छ केला जात आहे...

source: Splitting data into training and testing sets...
hi: डेटा को प्रशिक्षण और परीक्षण सेटों में विभाजित किया जा रहा है...
mr: डेटा प्रशिक्षण आणि चाचणी संचांमध्ये विभागला जात आहे...

source: Applying feature scaling...
hi: फ़ीचर स्केलिंग लागू की जा रही है...
mr: फीचर स्केलिंग लागू केले जात आहे...

source: Training Random Forest model with cross-validation...
hi: क्रॉस-वैलिडेशन के साथ रैंडम फ़ॉरेस्ट मॉडल प्रशिक्षित किया जा रहा है...
mr: क्रॉस-व्हॅलिडेशनसह रँडम फॉरेस्ट मॉडेल प्रशिक्षण दिले जात आहे...

source: Cross Validation Scores: %(scores)s
hi: क्रॉस-वैलिडेशन स्कोर: %(scores)s
mr: क्रॉस-व्हॅलिडेशन गुण: %(scores)s

source: Mean CV Score: %(score).4f
hi: औसत CV स्कोर: %(score).4f
mr: सरासरी CV गुण: %(score).4f

source: Performing hyperparameter tuning...
hi: हाइपरपैरामीटर ट्यूनिंग की जा रही है...
mr: हायपरपॅरामिटर ट्यूनिंग करण्यात येत आहे...

source: Best Parameters: %(params)s
hi: श्रेष्ठ पैरामीटर: %(params)s
mr: सर्वोत्तम पॅरामिटर: %(params)s

source: Best CV Score: %(score).4f
hi: श्रेष्ठ CV स्कोर: %(score).4f
mr: सर्वोत्तम CV गुण: %(score).4f

source: Test Accuracy: %(acc).4f
hi: परीक्षण सटीकता: %(acc).4f
mr: चाचणी अचूकता: %(acc).4f

source: Classification Report:
hi: वर्गीकरण रिपोर्ट:
mr: वर्गीकरण अहवाल:

source: Feature Importances:
hi: फ़ीचर महत्त्व:
mr: फीचरचे महत्त्व:

source: Saving model and preprocessing objects...
hi: मॉडल और प्री-प्रोसेसिंग ऑब्जेक्ट सहेजे जा रहे हैं...
mr: मॉडेल आणि प्री-प्रोसेसिंग ऑब्जेक्ट साठवले जात आहेत...

source: Model training completed successfully!
hi: मॉडल प्रशिक्षण सफलतापूर्वक पूर्ण हुआ!
mr: मॉडेल प्रशिक्षण यशस्वीरीत्या पूर्ण झाले!

source: Model artifacts not found. Training a new model...
hi: मॉडल आर्टिफैक्ट नहीं मिले। नया मॉडल प्रशिक्षित किया जा रहा है...
mr: मॉडेल आर्टिफॅक्ट सापडले नाहीत. नवीन मॉडेल प्रशिक्षण दिले जात आहे...

source: Starting training via CLI...
hi: CLI के माध्यम से प्रशिक्षण प्रारंभ किया जा रहा है...
mr: CLI द्वारे प्रशिक्षण सुरू केले जात आहे...

source: Testing prediction with sample data:
hi: नमूना डेटा के साथ भविष्यवाणी का परीक्षण:
mr: नमुना डेटासह अंदाजाची चाचणी:

source: Test Case %(n)d:
hi: परीक्षण केस %(n)d:
mr: चाचणी प्रकरण %(n)d:

source: Input: %(inp)s
hi: इनपुट: %(inp)s
mr: इनपुट: %(inp)s

source: Predicted Crop: %(crop)s
hi: अनुमानित फसल: %(crop)s
mr: अंदाजित पिक: %(crop)s

source: Confidence: %(p).2f%%
hi: विश्वसनीयता: %(p).2f%%
mr: विश्वास: %(p).2f%%

source: About - KRUSHIMITRA
hi: परिचय - KRUSHIMITRA
mr: बद्दल - KRUSHIMITRA

source: breadcrumb
hi: ब्रेडक्रंब
mr: ब्रेडक्रंब

source: Home
hi: मुखपृष्ठ
mr: मुख्यपृष्ठ

source: About
hi: परिचय
mr: बद्दल

source: An EDA Project by Yash Raut
hi: यश राऊत द्वारा एक EDA प्रोजेक्ट
mr: यश राऊत यांचा EDA प्रकल्प

source: About the Project
hi: परियोजना के बारे में
mr: प्रकल्पाबद्दल

source: KRUSHIMITRA: Smart Crop Recommendation System
hi: KRUSHIMITRA: स्मार्ट फसल अनुशंसा प्रणाली
mr: KRUSHIMITRA: स्मार्ट पीक शिफारस प्रणाली

source: This project leverages machine learning to recommend optimal crops based on soil nutrient content and environmental conditions.
hi: यह परियोजना मशीन लर्निंग का उपयोग करके मिट्टी के पोषक तत्वों की मात्रा और पर्यावरणीय परिस्थितियों के आधार पर उपयुक्त फसलों की अनुशंसा करती है।
mr: हा प्रकल्प मशीन लर्निंगचा उपयोग करून मातीतील पोषक द्रव्ये आणि पर्यावरणीय परिस्थितींवर आधारित योग्य पिकांची शिफारस करतो.

source: Agriculture plays a critical role in India's economic development and is the backbone of our agrarian economy. By using machine learning to recommend crops, we can increase agricultural productivity and sustainability. Our system analyzes soil composition (Nitrogen, Phosphorus, Potassium), weather conditions (temperature, humidity, rainfall), and soil pH to recommend the crop most likely to thrive in those conditions.
hi: कृषि भारत के आर्थिक विकास में महत्वपूर्ण भूमिका निभाती है और हमारी कृषि प्रधान अर्थव्यवस्था की रीढ़ है। मशीन लर्निंग से फसल की अनुशंसा करके, हम कृषि उत्पादकता और स्थिरता बढ़ा सकते हैं। हमारा सिस्टम मिट्टी की संरचना (नाइट्रोजन, फॉस्फोरस, पोटैशियम), मौसम की स्थितियाँ (तापमान, आर्द्रता, वर्षा) और मिट्टी का pH विश्लेषित करके उन परिस्थितियों में सबसे उपयुक्त फसल सुझाता है।
mr: भारताच्या आर्थिक विकासात शेती अत्यंत महत्त्वाची भूमिका बजावते आणि आपल्या कृषी अर्थव्यवस्थेचा कणा आहे. मशीन लर्निंगच्या सहाय्याने पिकांची शिफारस केल्याने उत्पादकता आणि शाश्वतता वाढवता येते. आमची प्रणाली मातीची रचना (नायट्रोजन, फॉस्फरस, पोटॅशियम), हवामान स्थिती (तापमान, आर्द्रता, पर्जन्यमान) आणि मातीचे pH विश्लेषित करून त्या परिस्थितीत चांगले वाढणारे पीक सुचवते.

source: How It Works
hi: यह कैसे काम करता है
mr: कसे कार्य करते

source: Our system uses a Random Forest classification algorithm trained on a comprehensive dataset of crop growth conditions. This model identifies complex patterns in the data to provide accurate crop recommendations.
hi: हमारा सिस्टम फसल वृद्धि की परिस्थितियों के व्यापक डेटासेट पर प्रशिक्षित रैंडम फ़ॉरेस्ट वर्गीकरण एल्गोरिद्म का उपयोग करता है। यह मॉडल डेटा में जटिल पैटर्न पहचानकर सटीक फसल अनुशंसाएँ प्रदान करता है।
mr: आमची प्रणाली पिकांच्या वाढीच्या परिस्थितींवरील व्यापक डेटासेटवर प्रशिक्षित Random Forest वर्गीकरण अल्गोरिदम वापरते. हा मॉडेल डेटातील गुंतागुंतीचे नमुने ओळखून अचूक पीक शिफारसी प्रदान करतो.

source: Technical Implementation
hi: तकनीकी कार्यान्वयन
mr: तांत्रिक अंमलबजावणी

source: Machine Learning Model:
hi: मशीन लर्निंग मॉडल:
mr: मशीन लर्निंग मॉडेल:

source: Random Forest Classifier with hyperparameter tuning
hi: हाइपरपैरामीटर ट्यूनिंग सहित रैंडम फ़ॉरेस्ट क्लासिफ़ायर
mr: हायपरपॅरामिटर ट्यूनिंगसह रँडम फॉरेस्ट क्लासिफायर

source: Web Application:
hi: वेब एप्लिकेशन:
mr: वेब अॅप्लिकेशन:

source: Flask framework with responsive Bootstrap UI
hi: Flask फ्रेमवर्क तथा उत्तरदायी Bootstrap UI
mr: Flask फ्रेमवर्क व प्रतिसादक्षम Bootstrap UI

source: Data Preprocessing:
hi: डेटा पूर्व-प्रसंस्करण:
mr: डेटा पूर्वप्रक्रिया:

source: MinMaxScaler and StandardScaler for feature normalization
hi: फ़ीचर सामान्यीकरण हेतु MinMaxScaler और StandardScaler
mr: फीचर नॉर्मलायझेशनसाठी MinMaxScaler आणि StandardScaler

source: Evaluation Metrics:
hi: मूल्यांकन मीट्रिक्स:
mr: मूल्यमापन निर्देशांक:

source: Classification accuracy, cross-validation, detailed classification reports
hi: वर्गीकरण सटीकता, क्रॉस-वैलिडेशन, विस्तृत वर्गीकरण रिपोर्ट
mr: वर्गीकरण अचूकता, क्रॉस-व्हॅलिडेशन, सविस्तर वर्गीकरण अहवाल

source: Benefits
hi: लाभ
mr: फायदे

source: Economic
hi: आर्थिक
mr: आर्थिक

source: Increased crop yields
hi: फसल उपज में वृद्धि
mr: पीक उत्पादनात वाढ

source: Optimized resource utilization
hi: संसाधनों का अनुकूल उपयोग
mr: संसाधनांचा कार्यक्षम वापर

source: Reduced crop failure risks
hi: फसल विफलता का जोखिम कम
mr: पीक अपयशाचा धोका कमी

source: Better return on investment
hi: निवेश पर बेहतर प्रतिफल
mr: गुंतवणुकीवर अधिक परतावा

source: Environmental
hi: पर्यावरणीय
mr: पर्यावरणीय

source: Sustainable farming practices
hi: सतत कृषि पद्धतियाँ
mr: शाश्वत शेती पद्धती

source: Reduced fertilizer waste
hi: उर्वरक अपव्यय में कमी
mr: खतांचा अपव्यय कमी

source: Optimal land utilization
hi: भूमि का उत्तम उपयोग
mr: जमिनीचा सर्वोत्तम वापर

source: Better water resource management
hi: जल संसाधन प्रबंधन में सुधार
mr: पाणी संसाधन व्यवस्थापनात सुधारणा

source: Our Team
hi: हमारी टीम
mr: आमची टीम

source: KRUSHIMITRA is an Exploratory Data Analysis project developed by students of AISSMS IOIT, Pune
hi: KRUSHIMITRA, AISSMS IOIT, पुणे के छात्रों द्वारा विकसित एक एक्सप्लोरेटरी डेटा एनालिसिस (EDA) परियोजना है
mr: KRUSHIMITRA हा AISSMS IOIT, पुणे येथील विद्यार्थ्यांनी विकसित केलेला Exploratory Data Analysis (EDA) प्रकल्प आहे

source: Team Lead & ML Engineer
hi: टीम लीड और ML इंजीनियर
mr: टीम लीड व ML अभियंता

source: Second Year
hi: द्वितीय वर्ष
mr: द्वितीय वर्ष

source: Artificial Intelligence
hi: कृत्रिम बुद्धिमत्ता
mr: कृत्रिम बुद्धिमत्ता

source: Data Scientist & Backend Developer
hi: डेटा साइंटिस्ट और बैकएंड डेवलपर
mr: डेटा सायंटिस्ट व बॅकएंड डेव्हलपर

source: UI/UX Designer & Frontend Developer
hi: UI/UX डिज़ाइनर और फ़्रंटएंड डेवलपर
mr: UI/UX डिझायनर व फ्रन्टएंड डेव्हलपर

source: Guided By Faculty
hi: प्राध्यापकों के मार्गदर्शन में
mr: विद्याशाखेच्या मार्गदर्शनाखाली

source: Department of Computer Engineering
hi: कंप्यूटर इंजीनियरिंग विभाग
mr: कंप्युटर अभियांत्रिकी विभाग

source: AISSMS Institute of Information Technology, Pune
hi: AISSMS इंस्टीट्यूट ऑफ़ इन्फ़ॉर्मेशन टेक्नोलॉजी, पुणे
mr: AISSMS इन्स्टिट्यूट ऑफ इन्फॉर्मेशन टेक्नॉलॉजी, पुणे

source: Data Sources
hi: डेटा स्रोत
mr: डेटा स्रोत

source: The model is trained on the Crop Recommendation Dataset containing 2200 samples with the following attributes:
hi: मॉडल को 2200 नमूनों तथा निम्नलिखित विशेषताओं वाले क्रॉप रिकमेंडेशन डेटासेट पर प्रशिक्षित किया गया है:
mr: २२०० नमुने व खालील वैशिष्ट्ये असलेल्या Crop Recommendation डेटासेटवर मॉडेल प्रशिक्षित केले आहे:

source: Nitrogen (N)
hi: नाइट्रोजन (N)
mr: नायट्रोजन (N)

source: Phosphorus (P)
hi: फॉस्फोरस (P)
mr: फॉस्फरस (P)

source: Potassium (K)
hi: पोटैशियम (K)
mr: पोटॅशियम (K)

source: Temperature
hi: तापमान
mr: तापमान

source: Humidity
hi: आर्द्रता
mr: आर्द्रता

source: Rainfall
hi: वर्षा
mr: पर्जन्यमान

source: Supported Crops
hi: समर्थित फसलें
mr: समर्थित पिके

source: Our system can recommend the following crops based on your inputs:
hi: आपके इनपुट के आधार पर हमारा सिस्टम निम्नलिखित फसलों की अनुशंसा कर सकता है:
mr: आपल्या इनपुटच्या आधारे आमची प्रणाली खालील पिकांची शिफारस करू शकते:

source: Rice
hi: धान
mr: भात

source: Maize
hi: मक्का
mr: मका

source: Jute
hi: जूट
mr: ज्यूट

source: Cotton
hi: कपास
mr: कापूस

source: Orange
hi: संतरा
mr: संत्री

source: Apple
hi: सेब
mr: सफरचंद

source: Mango
hi: आम
mr: आंबा

source: Banana
hi: केला
mr: केळी

source: Chickpea
hi: चना
mr: हरभरा

source: Coffee
hi: कॉफी
mr: कॉफी

source: Watermelon
hi: तरबूज
mr: कलिंगड

source: Grapes
hi: अंगूर
mr: द्राक्षे

source: Farming
hi: खेती
mr: शेती

source: Jai Jawan Jai Kisan
hi: जय जवान जय किसान
mr: जय जवान जय किसान

source: Lal Bahadur Shastri
hi: लाल बहादुर शास्त्री
mr: लाल बहादुर शास्त्री

source: KRUSHIMITRA - Smart Crop Recommendation
hi: KRUSHIMITRA - स्मार्ट फसल अनुशंसा
mr: KRUSHIMITRA - स्मार्ट पीक शिफारस

source: Toggle navigation
hi: नेविगेशन टॉगल करें
mr: नेव्हिगेशन टॉगल करा

source: Data Insights
hi: डेटा अंतर्दृष्टि
mr: डेटा अंतर्दृष्टी

source: A machine learning-based crop recommendation system to help farmers make informed decisions.
hi: किसानों को सूचित निर्णय लेने में मदद के लिए मशीन लर्निंग-आधारित फसल अनुशंसा प्रणाली।
mr: शेतकऱ्यांना सूचित निर्णय घेण्यास मदत करणारी मशीन लर्निंग-आधारित पीक शिफारस प्रणाली.

source: An EDA Project by Pranav Ladkat, Snehal Mane, and Pratik Khatke
hi: प्रणव लडकट, स्नेहल माने और प्रतिक खटके द्वारा EDA परियोजना
mr: प्रणव लडकट, स्नेहल माने आणि प्रतीक खटके यांचा EDA प्रकल्प

source: AISSMS IOIT, Pune
hi: AISSMS IOIT, पुणे
mr: AISSMS IOIT, पुणे

source: Quick Links
hi: त्वरित लिंक
mr: त्वरित दुवे

source: API Access
hi: API एक्सेस
mr: API प्रवेश

source: Access our crop recommendation API for your agricultural applications.
hi: अपनी कृषि अनुप्रयोगों के लिए हमारी फसल अनुशंसा API का उपयोग करें।
mr: आपल्या कृषी अनुप्रयोगांसाठी आमची पीक शिफारस API वापरा.

source: API Documentation
hi: API दस्तावेज़
mr: API दस्तऐवजीकरण

source: KRUSHIMITRA - Agricultural Recommendation System
hi: KRUSHIMITRA - कृषि अनुशंसा प्रणाली
mr: KRUSHIMITRA - कृषी शिफारस प्रणाली

source: Data Insights - Crop Recommendation System
hi: डेटा अंतर्दृष्टि - फसल अनुशंसा प्रणाली
mr: डेटा अंतर्दृष्टी - पीक शिफारस प्रणाली

source: Data Insights and Visualization
hi: डेटा अंतर्दृष्टि और विज़ुअलाइज़ेशन
mr: डेटा अंतर्दृष्टी आणि दृश्यांकन

source: Our model is trained on a dataset with 2200 samples across 22 different crops. Here are some key insights from the exploratory data analysis.
hi: हमारा मॉडल 22 विभिन्न फसलों के 2200 नमूनों वाले डेटासेट पर प्रशिक्षित है। यहाँ अन्वेषणात्मक डेटा विश्लेषण (EDA) से कुछ प्रमुख अंतर्दृष्टियाँ दी गई हैं।
mr: आमचे मॉडेल २२ विविध पिकांच्या २२०० नमुन्यांच्या डेटासेटवर प्रशिक्षित आहे. येथे Exploratory Data Analysis (EDA) मधील काही महत्त्वाच्या अंतर्दृष्टी आहेत.

source: Crop Distribution
hi: फसल वितरण
mr: पीक वितरण

source: The dataset contains an equal distribution of 22 different crops with 100 samples for each crop type.
hi: इस डेटासेट में 22 विभिन्न फसलों का समान वितरण है; प्रत्येक फसल के 100 नमूने हैं।
mr: या डेटासेटमध्ये २२ पिकांचे समसमान वितरण आहे; प्रत्येक पिकाचे १०० नमुने आहेत.

source: Feature Importance
hi: फ़ीचर महत्त्व
mr: फीचरचे महत्त्व

source: The relative importance of each feature in the Random Forest model prediction.
hi: रैंडम फ़ॉरेस्ट मॉडल की भविष्यवाणी में प्रत्येक फ़ीचर का सापेक्ष महत्त्व।
mr: रँडम फॉरेस्ट मॉडेलच्या भाकितात प्रत्येक फीचरचे सापेक्ष महत्त्व.

source: Parameter Distribution by Crop
hi: फसल के अनुसार पैरामीटर वितरण
mr: पीकनिहाय पॅरामीटर वितरण

source: %(p)s Content by Crop
hi: %(p)s की मात्रा (फसल अनुसार)
mr: %(p)s ची मात्रा (पीकनिहाय)

source: %(p)s by Crop
hi: %(p)s (फसल अनुसार)
mr: %(p)s (पीकनिहाय)

source: %(p)s Requirements
hi: %(p)s आवश्यकताएँ
mr: %(p)s आवश्यकता

source: Statistical Summary
hi: सांख्यिकीय सारांश
mr: सांख्यिकीय सारांश

source: Descriptive Statistics of Features
hi: फ़ीचरों का वर्णनात्मक आँकड़ा
mr: फीचरची वर्णनात्मक सांख्यिकी

source: Statistic
hi: सांख्यिकी
mr: सांख्यिकी

source: Mean
hi: औसत
mr: सरासरी

source: Std
hi: मानक विचलन

source: Min
hi: न्यूनतम
mr: किमान

source: Max
hi: अधिकतम
mr: कमाल

source: Model Performance
hi: मॉडल प्रदर्शन
mr: मॉडेल कार्यक्षमता

source: Classification Metrics
hi: वर्गीकरण मीट्रिक्स
mr: वर्गीकरण निर्देशांक

source: Accuracy
hi: सटीकता
mr: अचूकता

source: Cross-Validation Score
hi: क्रॉस-वैलिडेशन स्कोर
mr: क्रॉस-व्हॅलिडेशन गुण

source: 99.09% (mean of 5-fold CV)
hi: 99.09% (5-फोल्ड CV का औसत)
mr: 99.09% (५-फोल्ड CV चे सरासरी)

source: Precision (Macro Avg)
hi: प्रेसिशन (मैक्रो औसत)
mr: प्रिसिजन (मॅक्रो सरासरी)

source: Recall (Macro Avg)
hi: रिकॉल (मैक्रो औसत)
mr: रीकॉल (मॅक्रो सरासरी)

source: F1-Score (Macro Avg)
hi: F1-स्कोर (मैक्रो औसत)
mr: F1-स्कोर (मॅक्रो सरासरी)

source: Hyperparameters
hi: हाइपरपैरामीटर
mr: हायपरपॅरामिटर

source: Algorithm
hi: अल्गोरिद्म
mr: अल्गोरिदम

source: Random Forest Classifier
hi: रैंडम फ़ॉरेस्ट क्लासिफ़ायर
mr: रँडम फॉरेस्ट क्लासिफायर

source: Feature Correlations
hi: फ़ीचर सहसंबंध
mr: फीचर सहसंबंध

source: Correlation matrix showing the relationships between different soil and climate parameters.
hi: विभिन्न मिट्टी व जलवायु पैरामीटरों के बीच संबंध दर्शाने वाला सहसंबंध मैट्रिक्स।
mr: भूसंरचना व हवामान पॅरामीटरमधील संबंध दर्शवणारा सहसंबंध मॅट्रिक्स.

source: Feature Correlation Matrix
hi: फ़ीचर सहसंबंध मैट्रिक्स
mr: फीचर सहसंबंध मॅट्रिक्स

source: Error - Crop Recommendation System
hi: त्रुटि - फसल अनुशंसा प्रणाली
mr: त्रुटी - पीक शिफारस प्रणाली

source: Error
hi: त्रुटि
mr: त्रुटी

source: Oops! Something went wrong
hi: उफ़! कुछ गड़बड़ हो गई
mr: अरेरे! काहीतरी चूक झाली

source: We encountered an error while processing your request.
hi: अनुरोध संसाधित करते समय एक त्रुटि मिली।
mr: आपला विनंती प्रक्रिया करताना त्रुटी आढळली.

source: Error Details:
hi: त्रुटि विवरण:
mr: त्रुटी तपशील:

source: What you can try:
hi: आप क्या कर सकते हैं:
mr: काय प्रयत्न करू शकता:

source: Check if all input fields contain valid values within the specified ranges
hi: जाँचें कि सभी इनपुट फ़ील्ड निर्धारित सीमा के भीतर मान्य मान रखते हों
mr: सर्व इनपुट फील्ड निर्दिष्ट परिघात योग्य मूल्यांनी भरले आहेत का ते तपासा

source: Make sure all fields are filled out correctly
hi: सुनिश्चित करें कि सभी फ़ील्ड सही ढंग से भरे गए हैं
mr: सर्व फील्ड बरोबर भरल्याची खात्री करा

source: Try refreshing the page and submitting the form again
hi: पेज ताज़ा करें और फ़ॉर्म पुनः सबमिट करने का प्रयास करें
mr: पृष्ठ रीफ्रेश करून फॉर्म पुन्हा सबमिट करून पाहा

source: Back to Home
hi: मुखपृष्ठ पर जाएँ
mr: मुख्यपृष्ठावर परत

source: Go Back
hi: वापस जाएँ
mr: मागे जा

source: KRUSHIMITRA - Smart Farming Advisor
hi: KRUSHIMITRA - स्मार्ट खेती सलाहकार
mr: KRUSHIMITRA - स्मार्ट शेती सल्लागार

source: An AI-powered crop recommendation system to empower Indian farmers
hi: AI-संचालित फसल अनुशंसा प्रणाली जो भारतीय किसानों को सशक्त बनाती है
mr: भारतीय शेतकऱ्यांना सक्षम करणारी AI-आधारित पीक शिफारस प्रणाली

source: Get Started
hi: शुरू करें
mr: सुरू करा

source: Smart Crop Recommendation
hi: स्मार्ट फसल अनुशंसा
mr: स्मार्ट पीक शिफारस

source: Our AI-powered system analyzes soil composition and environmental factors to recommend the optimal crop for your field.
hi: हमारा AI-संचालित सिस्टम मिट्टी की संरचना और पर्यावरणीय कारकों का विश्लेषण करके आपके खेत के लिए उपयुक्त फसल सुझाता है।
mr: आमची AI-संचालित प्रणाली मातीची रचना आणि पर्यावरणीय घटकांचे विश्लेषण करून आपल्या शेतासाठी योग्य पीक सुचवते.

source: Make data-driven farming decisions with our machine learning technology, trained on extensive agricultural datasets.
hi: विस्तृत कृषि डेटासेट पर प्रशिक्षित हमारी मशीन लर्निंग तकनीक के साथ डेटा-आधारित कृषि निर्णय लें।
mr: विस्तृत कृषी डेटासेटवर प्रशिक्षित आमच्या मशीन लर्निंग तंत्रज्ञानासह डेटा-आधारित शेती निर्णय घ्या.

source: Get Crop Recommendation
hi: फसल सिफारिश प्राप्त करें
mr: पीक शिफारस मिळवा

source: View Data Insights
hi: डेटा अंतर्दृष्टि देखें
mr: डेटा अंतर्दृष्टी पहा

source: Soil Analysis
hi: मिट्टी विश्लेषण
mr: माती विश्लेषण

source: Enter your soil's NPK values and pH level
hi: अपनी मिट्टी के NPK मान और pH स्तर दर्ज करें
mr: आपल्या मातीतले NPK मूल्ये व pH पातळी नमूद करा

source: Climate Data
hi: जलवायु डेटा
mr: हवामान डेटा

source: Input temperature, humidity, and rainfall data
hi: तापमान, आर्द्रता और वर्षा का डेटा दर्ज करें
mr: तापमान, आर्द्रता व पर्जन्यमान डेटा प्रविष्ट करा

source: AI Analysis
hi: AI विश्लेषण
mr: AI विश्लेषण

source: Our model processes your field's unique conditions
hi: हमारा मॉडल आपके खेत की विशिष्ट परिस्थितियों को संसाधित करता है
mr: आमचे मॉडेल आपल्या शेताच्या वैशिष्ट्यपूर्ण परिस्थिती प्रक्रियेत आणते

source: Crop Recommendation
hi: फसल अनुशंसा
mr: पीक शिफारस

source: Get personalized crop suggestions with confidence score
hi: विश्वसनीयता स्कोर के साथ व्यक्तिगत फसल सुझाव प्राप्त करें
mr: विश्वास गुणांसह वैयक्तिकृत पीक सूचना मिळवा

source: Crop Recommendation Form
hi: फसल अनुशंसा फ़ॉर्म
mr: पीक शिफारस फॉर्म

source: Nitrogen (N) Content
hi: नाइट्रोजन (N) मात्रा
mr: नायट्रोजन (N) मात्रा

source: Range: 0-140 kg/ha
hi: परास: 0-140 kg/ha
mr: परिघ: 0-140 kg/ha

source: Please enter a valid nitrogen value.
hi: कृपया मान्य नाइट्रोजन मान दर्ज करें।
mr: कृपया वैध नायट्रोजन मूल्य प्रविष्ट करा.

source: Phosphorus (P) Content
hi: फॉस्फोरस (P) मात्रा
mr: फॉस्फरस (P) मात्रा

source: Range: 5-145 kg/ha
hi: परास: 5-145 kg/ha
mr: परिघ: 5-145 kg/ha

source: Please enter a valid phosphorus value.
hi: कृपया मान्य फॉस्फोरस मान दर्ज करें।
mr: कृपया वैध फॉस्फरस मूल्य प्रविष्ट करा.

source: Potassium (K) Content
hi: पोटैशियम (K) मात्रा
mr: पोटॅशियम (K) मात्रा

source: Range: 5-205 kg/ha
hi: परास: 5-205 kg/ha
mr: परिघ: 5-205 kg/ha

source: Please enter a valid potassium value.
hi: कृपया मान्य पोटैशियम मान दर्ज करें।
mr: कृपया वैध पोटॅशियम मूल्य प्रविष्ट करा.

source: Range: 8.8-43.7 °C
hi: परास: 8.8-43.7 °C
mr: परिघ: 8.8-43.7 °C

source: Please enter a valid temperature value.
hi: कृपया मान्य तापमान मान दर्ज करें।
mr: कृपया वैध तापमान मूल्य प्रविष्ट करा.

source: Relative Humidity
hi: सापेक्ष आर्द्रता
mr: सापेक्ष आर्द्रता

source: Range: 14.3-100%
hi: परास: 14.3-100%
mr: परिघ: 14.3-100%

source: Please enter a valid humidity value.
hi: कृपया मान्य आर्द्रता मान दर्ज करें।
mr: कृपया वैध आर्द्रता मूल्य प्रविष्ट करा.

source: pH Value
hi: pH मान
mr: pH मूल्य

source: Range: 3.5-10 pH
hi: परास: 3.5-10 pH
mr: परिघ: 3.5-10 pH

source: Please enter a valid pH value.
hi: कृपया मान्य pH मान दर्ज करें।
mr: कृपया वैध pH मूल्य प्रविष्ट करा.

source: Range: 20.2-298.6 mm
hi: परास: 20.2-298.6 mm
mr: परिघ: 20.2-298.6 mm

source: Please enter a valid rainfall value.
hi: कृपया मान्य वर्षा मान दर्ज करें।
mr: कृपया वैध पर्जन्यमान मूल्य प्रविष्ट करा.

source: Reset Form
hi: फ़ॉर्म रीसेट करें
mr: फॉर्म रीसेट करा

source: Our system can recommend these crops based on your inputs:
hi: आपके इनपुट के आधार पर हमारा सिस्टम ये फसलें सुझा सकता है:
mr: आपल्या इनपुटच्या आधारे आमची प्रणाली ही पिके सुचवू शकते:
